<template>
    <div v-show="show" class="fixed inset-0 z-50 bg-black/60 flex items-center justify-center" @click.self="closeModal">
        <transition name="grow-fade">
            <div v-if="visible" style="box-shadow: 0px 0px 10px 0px #00000026"
                class="w-[330px] h-[440px] bg-white rounded-[8px] text-center px-[15px] py-[30px] flex flex-col transition-transform items-center">
                <!-- Icon -->
                <div class="flex flex-col items-center w-full">
                    <div class="w-[120px] h-[120px] rounded-full bg-[#f3f4f6] flex items-center justify-center mb-[10px]">
                        <div class="w-[67px] h-[78px]">
                            <svg width="67" height="78" viewBox="0 0 67 78" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M57.4219 75.8242H9.57865C4.99174 75.8242 1.26001 72.0925 1.26001 67.5056V38.7996C1.26001 34.2127 4.99174 30.4809 9.57865 30.4809H11.9708H13.2208V29.2309V22.0545C13.2208 19.3174 13.757 16.6624 14.8145 14.1631C15.8362 11.7486 17.299 9.57955 19.1622 7.71634C21.0254 5.85313 23.1944 4.39036 25.609 3.36868C28.1082 2.31119 30.7632 1.77499 33.5003 1.77499C36.2374 1.77499 38.8924 2.31119 41.3916 3.36868C43.8062 4.39036 45.9752 5.85313 47.8384 7.71634C49.7016 9.57955 51.1644 11.7486 52.1861 14.1631C53.2436 16.6624 53.7798 19.3174 53.7798 22.0545V29.2309V30.4809H55.0298H57.4219C62.0088 30.4809 65.7406 34.2127 65.7406 38.7996V67.5056C65.7406 72.0925 62.0088 75.8242 57.4219 75.8242ZM33.5003 8.84365C26.2158 8.84365 20.2895 14.77 20.2895 22.0545V29.2309V30.4809H21.5395H45.4611H46.7111V29.2309V22.0545C46.7111 14.77 40.7848 8.84365 33.5003 8.84365Z"
                                    fill="#C09FFF" />
                                <path
                                    d="M33.5003 3.02499C28.4194 3.02499 23.6413 5.00498 20.0461 8.60023C16.4508 12.1955 14.4708 16.9736 14.4708 22.0545V31.7309H9.57866C5.68099 31.7309 2.51001 34.9019 2.51001 38.7996V67.5056C2.51001 71.4032 5.68099 74.5742 9.57866 74.5742H57.4219C61.3196 74.5742 64.4906 71.4032 64.4906 67.5056V38.7996C64.4906 34.9019 61.3196 31.7309 57.4219 31.7309H52.5298V22.0545C52.5298 16.9736 50.5498 12.1955 46.9545 8.60023C43.3593 5.00498 38.5812 3.02499 33.5003 3.02499ZM47.9611 31.7309H19.0395V22.0545C19.0395 14.0807 25.5266 7.59364 33.5003 7.59364C41.474 7.59364 47.9611 14.0807 47.9611 22.0545V31.7309ZM33.5003 0.524994C45.3864 0.524994 55.0298 10.1684 55.0298 22.0545V29.2309H57.4219C62.6996 29.2309 66.9906 33.5219 66.9906 38.7996V67.5056C66.9906 72.7833 62.6996 77.0742 57.4219 77.0742H9.57866C4.30095 77.0742 0.0100098 72.7833 0.0100098 67.5056V38.7996C0.0100098 33.5219 4.30095 29.2309 9.57866 29.2309H11.9708V22.0545C11.9708 10.1684 21.6142 0.524994 33.5003 0.524994ZM45.4611 29.2309V22.0545C45.4611 15.4461 40.1086 10.0936 33.5003 10.0936C26.8919 10.0936 21.5395 15.4461 21.5395 22.0545V29.2309H45.4611Z"
                                    fill="#300378" />
                                <path
                                    d="M7.79277 60.3763C7.58284 60.376 7.37491 60.4171 7.18091 60.4973C6.98692 60.5776 6.81068 60.6953 6.66232 60.8439C6.51397 60.9924 6.39641 61.1688 6.3164 61.3628C6.23639 61.5569 6.19551 61.7649 6.1961 61.9748L6.17422 68.5369C6.18586 68.9567 6.35798 69.356 6.65515 69.6527C6.95232 69.9494 7.35193 70.1209 7.77171 70.1319C8.05834 70.1256 8.3388 70.0475 8.58735 69.9046C8.82882 69.7627 9.02929 69.5605 9.16912 69.3178C9.30896 69.0752 9.38337 68.8003 9.38506 68.5203L9.39026 61.9713C9.39364 61.7607 9.35461 61.5516 9.27549 61.3564C9.19637 61.1611 9.07878 60.9839 8.92973 60.835C8.78068 60.6862 8.6032 60.5689 8.40788 60.4901C8.21255 60.4113 8.00336 60.3726 7.79277 60.3763Z"
                                    fill="#300378" />
                                <path
                                    d="M7.93578 55.7477C7.72518 55.7443 7.51605 55.7834 7.32085 55.8625C7.12565 55.9416 6.94837 56.0592 6.79955 56.2082C6.65074 56.3573 6.53343 56.5348 6.45463 56.7301C6.37582 56.9254 6.33713 57.1346 6.34084 57.3452L6.32092 57.3567C6.3208 57.5664 6.36205 57.7741 6.44232 57.9678C6.52259 58.1615 6.6403 58.3375 6.7887 58.4857C6.93709 58.6338 7.11327 58.7512 7.30713 58.8312C7.50098 58.9112 7.70871 58.9521 7.91841 58.9516C8.19885 58.9496 8.47395 58.8747 8.71673 58.7344C8.96237 58.5978 9.16617 58.397 9.30626 58.1533C9.44634 57.9097 9.51742 57.6325 9.51185 57.3515L9.52917 57.3415C9.53238 57.1314 9.49337 56.9227 9.41444 56.7279C9.33551 56.5331 9.21826 56.3562 9.06967 56.2075C8.92107 56.0589 8.74413 55.9416 8.54936 55.8626C8.35458 55.7836 8.14593 55.7445 7.93578 55.7477Z"
                                    fill="#300378" />
                            </svg>


                        </div>
                    </div>
                    <h2 class="text-[#300378] text-[28px] text-center font-bold mb-[10px]">للمشتركين فقط</h2>
                    <ul class="text-right text-[16px] text-black leading-6 w-full">
                        <li>• خطة مخصصة لك من روبوت اختبارات</li>
                        <li>• عرض طريقة الحل والقوانين</li>
                        <li>• تحليلات شاملة لمستواك</li>
                        <li>• توقع درجتك في الاختبار الحقيقي</li>
                        <li class="mt-[10px] font-bold text-center">وغيرها الكثير من المزايا…</li>
                    </ul>
                </div>

                <!-- CTA -->
                <button @click="router.push('/prices')"
                    style="background: linear-gradient(270deg, #24A7F1 0%, #0266D6 100%)"
                    class="text-white w-[164px] h-[43px] font-bold text-[18px] mt-[30px] rounded-[8px] cursor-pointer">
                    اشترك الآن
                </button>
            </div>
        </transition>
    </div>
</template>

<script setup lang="ts">
import { ref, onMounted } from 'vue'

const visible = ref(false)

const router = useRouter()

const props = defineProps({
    show: {
        type: Boolean,
        default: false,
        required: false
    }
})

const emit = defineEmits<{
    (e: 'update:show', value: boolean): void
}>()


onMounted(() => {
    visible.value = true
})

const closeModal = () => {
    visible.value = false
    setTimeout(() => {
        emit('update:show', false)
    }, 300)
}
</script>

<style scoped>
/* Transition */
.grow-fade-enter-active,
.grow-fade-leave-active {
    transition: all 0.3s ease;
}

.grow-fade-enter-from,
.grow-fade-leave-to {
    opacity: 0;
    transform: scale(0.9);
}

.grow-fade-enter-active {
    animation: grow-fade-in 0.4s ease forwards;
}

.grow-fade-leave-active {
    animation: grow-fade-out 0.4s ease forwards;
}

@keyframes grow-fade-in {
    0% {
        opacity: 0;
        transform: scale(0.8);
    }

    100% {
        opacity: 1;
        transform: scale(1);
    }
}

@keyframes grow-fade-out {
    0% {
        opacity: 1;
        transform: scale(1);
    }

    100% {
        opacity: 0;
        transform: scale(0.8);
    }
}
</style>
